TOKEN = '5243760919:AAH4yQl-9l4aoQx3s4klihyeIT73_GUUI0A'
noun = '''Имя существительное — часть речи, которая обозначает предмет и отвечает на вопросы кто? что? (человек, животное, молодёжь, музей, Москва, доброта, бег, синева) и имеет категории рода, числа и падежа.
1. Нарицательные и собственные имена существительные
Нарицательные — существительные, представляющие собой обобщённые наименования однородных предметов и явлений (море, река, созвездие, город, гора, чувство и т. д.). Эти наименования носят понятийный характер, поскольку служат именем не отдельного конкретного предмета, а всех предметов и явлений одного типа. Нарицательные имена существительные пишутся со строчной (маленькой) буквы.

Имена собственные — существительные, обозначающие индивидуальные названия отдельных живых существ, предметов или явлений и выделяющие его из ряда однородных (Енисей, Стрелец, Памир, Рязань, Марина Цветаева и т. п.). К именам собственным относятся фамилии, имена и отчества, псевдонимы и прозвища людей, клички животных; географические, астрономические названия; названия произведений литературы и искусства, газет, журналов; исторических событий, праздников, предприятий, магазинов, кафе и т. д.
2. Одушевлённые и неодушевлённые имена существительные
Одушевлённые существительные обозначают живые существа (людей, животных) и отвечают на вопрос кто? Например: врач, спортсмен, медведь, журавль.

Неодушевлённые существительные обозначают наименования неживых предметов, явлений, абстрактных понятий и отвечают на вопрос что? Например: велосипед, учебник, вечер, радость.
3. Конкретные и абстрактные имена существительные
Конкретные существительные обозначают реальные предметы (дом, стол, лампа).Абстрактные (отвлечённые) существительные обозначают непредметные понятия — качества, свойства, действия или процессы (быстрота, ловкость, рисование). Как правило, множественного числа не имеют.
4. Собирательные и единичные имена существительные
Собирательные существительные обозначают совокупность однородных предметов как целое (листва, студенчество). Имеют форму множественного числа.

Единичные существительные обозначают предметы, выделенные из совокупности (соломинка, пылинка, соринка).

5. Род имён существительных
Имена существительные относятся к одному из трёх ро­дов только в единственном числе: мужскому (вестибюль, тюль, рельс, шампунь); женско­му (вуаль, мозоль); среднему (заседание, повидло, регби, шасси). Имена существительные по родам не изменяются.

У неизменяемых слов иноязычного происхожде­ния род определяется следующим образом:

если слово обозначает неодушевленный предмет, оно среднего рода (эскимо, метро, интервью); исключения — кофе (муж. род), авеню, кольраби (жен. род);
если слово обозначает лиц женского пола, оно относится к женскому роду (мадам, леди, мисс);
если слово обозначает лиц мужского пола или животных, оно относится к мужскому роду (атташе, денди, пони, ка­каду);
если слово является географическим названием, его род определяется родом того нарицательного имени, которым это название может быть заменено: Колорадо — женский род, если это река, и мужской род, если это штат; Суху­ми — мужской род, так как это город.6. Число имён существительных
Число — словоизменительная категория имён существительных. Она выражается противопоставлением форм единственного и множественного числа, образуемых соответствующими окончаниями. Эти окончания несут также значения определённого падежа и рода.

Все существительные разделяются на три категории: 1) те, что могут иметь формы как единственного, так и множественного числа; 2) те, что имеют только форму единственного числа; 3) те, что имеют только форму множественного числа.'''

adjective = '''И́мя прилага́тельное — самостоятельная часть речи, обозначающая непроцессуальный признак предмета и отвечающая на вопросы «какой?», «какая?», «какое?», «какие?», «чей?» и так далее. В русском языке прилагательные изменяются по родам, падежам и числам, могут иметь краткую форму. В предложении прилагательное чаще всего бывает определением, но может быть и сказуемым. Имеет тот же падеж, что и имя существительное, к которому оно относится.'''
numbers = '''Имя числительное — часть речи, которая обозначает количество предметов, число, а также порядок предметов при счете.
По значению и грамматическим признакам имена числительные делятся на количественные и порядковые.
Количественные числительные обозначают количество или число и отвечают на вопрос сколько?
Порядковые числительные обозначают порядок предметов при счете и отвечают на вопросы какой? какая? какое? какие?'''
pronouns = '''Местоимение – часть речи, которая указывает на лицо, предмет или признак, но не называет их.
Местоимения делятся на:
— Личные: я, мы, ты, вы, он, она, оно, они.
— Возвратное: себя.
— Притяжательные: мой, наш, твой, ваш, свой.
— Вопросительно-относительные: кто, что, какой, каков, который, чей, сколько.
— Указательные: этот, тот, такой, таков, столько.
— Определительные: сам, самый, весь (вся, всё, все), всякий, каждый, любой, иной.
— Отрицательные: никто, ничто, никакой, ничей, никоторый, некого, нечего.
— Неопределенные: некто, нечто, некоторый, некий, несколько, кто-то, что-то, сколько-нибудь, какой-либо, кое-что и др.
 '''
verb = '''Что такое глагол в русском языке:
В русском языке глагол является самостоятельной частью речи, обозначающей процесс, отношение, действие или состояние лица, предмета либо явления.
Грамматическое значение глагола выражается: категориями вида, возвратности, переходности, наклонения, залога, числа, лица, рода и времени. Глагол как часть речи представлен несколькими классами форм:
-Спрягаемыми формами (читал, собирается);
-Инфинитивом (искать);
-Причастиями (написанный, сверкающий);
-Деепричастиями (нарисовав).
На какие вопросы отвечает глагол
Глагол отвечает на вопросы «Что делать?» (несовершенного вида), «Что сделать?» (совершенного вида). В составе предложений глаголы чаще всего выступают сказуемым, однако в русском языке используются конструкции, в которых отглагольные формы применяются в качестве подлежащего, определения, обстоятельства или дополнения.
Грамматические категории залога, вида, возвратности и переходности присущи всем глаголам и отглагольным формам, тогда как другие категории зависят от речевой ситуации, в которой глагол используется:
-Наклонение – присуще исключительно спрягаемым глаголам;
-Число – не свойственно инфинитиву и деепричастию;
-Род – присущ формам сослагательного наклонения, глаголам прошедшего времени и причастиям;
-Время – свойственно формам изъявительного наклонения;
-Лицо – присуще глаголам изъявительного наклонения настоящего и будущего времени, а также формам повелительного наклонения.
'''

infinitive = '''Инфинити́в (лат. infinitivus (modus) — неопределённый) — неопределённая форма глагола, одна из нефинитных (безличных) форм глагола. В русском языке инфинитив может входить в состав составного глагольного сказуемого. Например: рисовал — хочет рисовать, смотрит — любит смотреть.
Подобно форме именительного падежа у имени существительного, инфинитив является исходной формой глагола, которая даётся в словарях. Инфинитив состоит из основы и суффикса. Большинство глаголов имеет в инфинитиве суффикс -ть, следующий после конечной гласной основы: слабеть, давить, колоть, дуть.
'''
prich = '''
Причастие — это осо­бая фор­ма гла­го­ла, кото­рая обо­зна­ча­ет при­знак пред­ме­та по дей­ствию и соче­та­ет грам­ма­ти­че­ские при­зна­ки гла­го­ла и прилагательного.
Чтобы понять, что такое при­ча­стие в рус­ском язы­ке, ука­жем, что оно обра­зу­ет­ся от  гла­го­ла с помо­щью харак­тер­ных фор­мо­об­ра­зу­ю­щих суффиксов:

гла­дить — гладящий кош­ку;
отпра­вить — отпра­вивший пись­мо;
коле­бать — колеблемый вет­ром;
ука­зать — ука­занный ею.
Причастие — это осо­бая неспря­га­е­мая фор­ма гла­го­ла, кото­рая обла­да­ет при­зна­ка­ми при­ла­га­тель­но­го. С одной сто­ро­ны, при­ча­стие обо­зна­ча­ет при­знак, как и при­ла­га­тель­ное, но, с дру­гой сто­ро­ны, это при­знак осо­бен­ный, кото­рый свя­зан с дей­стви­ем.

'''
deeprich = ''' – истекши
промокнуть – промокнув
Деепричастие – неизменяемая форма глагола, обозначающая действие как признак другого действия (отвечает на вопросы: что делая, что сделав), например:
говорил, глядя в глаза; обессилев, присел на скамью.
Отличается от причастия тем, что не изменяется; имеет признаки вида и залога.
еепричастный оборот: деепричастие + зависимое слово:
Пропев до конца песню, раненые начали петь ее сначала. Голубь, увидев детей, взлетел вверх. Он что-то писал, наклонив голову.
Деепричастия несовершенного вида (что делая?):
основа глагола настоящего времени несовершенного вида + -а (-я):
сверкают — сверкая
гремят — гремя
стучат — стуча
Деепричастия несовершенного вида не образуются от глаголов:
с основой, состоящей из одних согласных: шьют, льют, жмут, ткут;
с основой на г, к: бегут, текут;
с основой настоящего времени на шипящий и с основой неопределенной формы на з, с, ст, х: мажут — мажут.
Деепричастия совершенного вида (что сделав?):
основа неопределенной формы глагола совершенного вида + -в (-вши), -ши, -а (-я)
прогулять – прогуляв
получить – получив
возвратиться — возвратившись
увидят — увидя
'''
narechie = '''Наречие – часть речи, обозначающая признак качества, действия или состояние предмета и отвечающая на вопросы: как? когда? почему? где? и проч. Основной признак наречия – неизменяемость: медленно, вчера, везде и т.д.
В состав наречий входят и местоименные наречия: где, нигде, так, как, никак, когда, никогда, иногда, откуда, куда, отсюда, там, туда, почему, потому, поэтому, зачем, затем и т.д.'''

predlog =  '''Предлог – это служебная неизменяемая часть речи, которая используется для соединения слова (следует отличать от союзов, которые соединяют не слова, а синтаксические единицы: члены предложения или части сложного предложения): в, к, с, на, из, у, сквозь, между, ради, посредством, вовремя, кругом, около, подобно, относительно, согласно, благодаря, спустя, несмотря на, неужели, в силу, в зависимости от, в связи с, по отношению к и проч.
Предлоги делятся на:
непроизводные предлоги
без, в, до, для, за, из, к, на, над, о, об, от, по, под, перед, при, про, с, у, через, из-за, из-под, …
производные предлоги
наречные предлоги: вблизи, внутри, вокруг, около и т.д.
отыменные предлоги: вследствие, в течение, путем, в продолжение и т.д.
отглагольные предлоги: благодаря, включая, исключая, спустя, начиная (с) и т.д.'''

souyz = '''Союз – это служебная неизменяемая часть речи, соединяющая члены предложения и/или части сложного предложения (отличать от предлогов, которые соединяют не синтаксические единицы, а слова).
Сочинительные союзы: и, да, а, но, или, либо, тоже, также.
Подчинительные союзы: когда, прежде чем, пока, что, чтобы, как, так как, потому что, благодаря тому что, так что, будто, словно, если, раз, хотя, несмотря на то что, для того чтобы, не только… но и…, не столько… сколько… и т.д.
 '''

connection = '''Связка – это оторвавшееся от парадигмы местоимения или глагола служебное слово. В функции связки входит указание на синтаксические отношения между компонентами предложения.
К связкам относятся:
— словосочетание это есть,
-eсть (и другие формы глагола быть),
— спрягаемые формы глаголов являться, явиться, значить, означать, называться.
Связки часто опускаются, а на их месте в предложении ставится тире:
Автомобиль – [есть] не роскошь, а средство передвижения.'''

parts_of_sentence = '''
В синтаксисе как разделе языкознания часто встречается понятие «члены предложения». В данной статье рассмотрим, что такое член предложение и какими они бывают.
Понятие
Члены предложения в русском языке – это слова, выполняющие в предложении определенную семантико-синтаксическую функцию.
Все члены предложения делятся на главные и второстепенные.
К главным относятся подлежащее и сказуемое. Они составляют грамматическую основу всего предложения. В предложении может отсутствовать либо подлежащее, либо сказуемое, однако наличие одного из них необходимо для построения предложения.
К второстепенным относятся обстоятельство, определение и дополнение.
Подлежащее
Подлежащее – это главный член предложения, обозначающий предмет речи и отвечающий на вопросы кто? что?.
По своему значению подлежащее – это то, о чем говорится в предложении. Это либо субъект, выполняющий действие, либо объект, над которым совершается действие.
Ошибочно думать, что подлежащим бывают только имена существительные или местоимения, подлежащим может быть любая часть речи или целые части предложения.
Подлежащее подчеркивается одной чертой.
Сказуемое
Сказуемое – это главный член предложения, обозначающий действие и отвечающий на вопросы что делает предмет речи? что с ним происходит? каков он?.
По типу сказуемые бывают простыми глагольными, составными именными, составными глагольными.
Сказуемое подчеркивается двумя чертами.
Обстоятельство
Обстоятельство – это второстепенный член предложения, обозначающий время, место, причину, образ действия.
Обстоятельство отвечает на вопросы где? куда? когда? откуда? почему? зачем? как?.
Обстоятельства подчеркиваются пунктирной линией с точками между штрихами.
Определение
Определение – это второстепенный член предложения, обозначающий признак предмета и отвечающий на вопросы какой? каков? чей?.
Определения бывают согласованными и несогласованными.
Определения подчеркиваются волнистой чертой.
Дополнение
Дополнение – это второстепенный член предложения, обозначающий объект.
Дополнение отличается от подлежащего тем, что оно отвечает на косвенные падежные вопросы: кого? чего? кому? чему? кого? что? кем? чем? о ком? о чем?.
Дополнения бывают прямыми и косвенными.

'''

types_of_sentence = '''
Предложения делятся на простые и сложные. Как простые, так и сложные предложения могут быть распространенными и нераспространенными, т.е. содержать или не содержать кроме главных членов предложения и второстепенные члены (определения, дополнения, обстоятельства и т.п.):
Он пришёл очень быстро. Он пришёл.
Простое предложение – это синтаксическая единица, образованная одной синтаксической связью между подлежащим и сказуемым или одним главным членом.
Двусоставное предложение – это простое предложение с подлежащим и сказуемым как необходимыми компонентами:
Они засмеялись. Он был умён. Туча – чёрная, тяжёлых очертаний.
Односоставное предложение – это простое предложение, в котором есть только один главный член (с зависимыми словами или без них). Односоставные предложения бывают:
— Неопределенно-личное:
Меня вызвали к директору.
— Обобщенно-личное:
Без труда не вытащишь и рыбку из пруда.
— Безличное:
На улице стемнело.
— Определенно-личное:
Сижу и рисую.
— Инфинитивное:
Молчать! Вам уже ехать.
— Назывное:
Ночь. Улица. Фонарь. Аптека.
Неполное предложение – это предложение, в котором отсутствует один или несколько членов (главных или второстепенных), на которые указывает контекст или ситуация:
Правда остаётся правдой, а молва – молвой. Мы разговорились, как будто век были знакомы. Вы, наверное, знаете о нашей работе? И обо мне? Я надену вот это синее.

Сложное предложение состоит из двух и более простых предложений, связанных по смыслу и/или при помощи союзов.
Сложные предложения делятся на:
— Сложносочиненные предложения состоят из частей (простых предложений), самостоятельных в грамматическом отношении, связанных по смыслу и при помощи сочинительных союзов и, а, но, да, или, либо, однако, зато, а также сложных сочинительных союзов ни… ни…, то… то…, то ли…, то ли…, не то…, не то… и др.:
Дождь кончился, и взошло солнце. То зазвонит телефон, то позвонят в дверь.
— Сложноподчиненные предложения состоят из частей (простых предложений), одна из которых не самостоятельна в грамматическом и смысловом отношении; части связаны при помощи подчинительных союзов и союзных слов: что, чтобы, где, когда, куда, почему, если (ежели), как, пока, хотя, поэтому, какой, который, чей и т.д., а также сложных подчинительных союзов: благодаря тому что, ввиду того что, вследствие того что, вместо того чтобы, несмотря на то что, прежде чем, с тех пор как и др. Подчинительный союз и союзное слово – всегда в придаточном предложении:
Я знаю, что они друзья. Он не хочет, чтобы его ждали. Сергей не ответил, потому что не слышал вопроса.
— Бессоюзные предложения. Части бессоюзного предложения (простые предложения) почти всегда самостоятельны в грамматическом отношении, но иногда неравноправны по смыслу; союзы и союзные слова отсутствуют:
Сияло солнце, зеленели берёзы, свистели птицы. Слышу: стучат в дверь. Сыр выпал – с ним была плутовка такова.
'''

signs = {'🔘Точка':''' Точка ставится:
— в конце повествовательного предложения, простого или сложного:
Скупо грело солнце. Ветер шевелил траву, которая давно выгорела.
— в конце побудительного предложения пи спокойном тоне речи:
Напиши письмо. Пойдём.
— в конце развернутых рубрик при перечислении:
Утвердить следующий порядок работы:
1. Отчёт правления.
2. Отчёты представителей первичных организаций.
3. Утверждение плана работы.
— на месте сокращения:''',

         '❓Вопросительный знак':'''Вопросительный знак ставится:
— в конце простого вопросительного предложения:
Кто я? Что я?
— в конце сложного предложения, если во всех его частях или в последней части содержится вопрос:
Помнишь, как вместе ходили в походы? Неужели вы не знаете, когда это было?
Вопросительный знак не ставится после косвенного вопроса:
Выясните у него, что нам делать. ''',

         '❗Восклицательный знак':''' Восклицательный знак ставится:
— в конце восклицательного предложения:
Не всё продаётся за деньги!
— после обращений:
Петя! Привет!
— после междометий:
Ах! Какой грех! Бух! Ухнуло где-то вдали.
— после слов да и нет, стоящих перед предложениями:
Нет! Никогда я зависти не знал.
В трех последних случаях постановка восклицательного знака необязательна и диктуется намерениями говорящего или пишущего; можно поставить и запятую.''',

         'Многоточие':'''Многоточие ставится:
— в начале, середине и конце текста для обозначения незаконченности высказывания, прерванности речи:
Помогите мне собраться… А потом посидим напоследок вместе, как сиживали когда-то… Давно…
— для обозначения пауз при описании быстро сменяющихся явлений, при неожиданности перехода от одной мысли к другой:
Хлынули потоки дождя… запрыгал град… столпились тучи… Вдруг топот!.. Кровь её застыла. Вот ближе… скачут…
— в цитатах для указания пропуска слов и предложений: Белинский писал:
“…Онегин не был ни холоден, ни сух, ни чёрств… вообще он не был из числа обыкновенных, дюжинных людей”. ''',

         'Точка с запятой':'''Точка с запятой:
— разделяет распространенные однородные члены без союзов, если внутри них уже есть запятые:
Но куклы, даже в эти годы,
Татьяна в руки не брала;
Про вести города, про моды
Беседы с нею не вела.
— разделяет достаточно распространенные предложения внутри сложного предложения:
У меня была только синяя краска; но, несмотря на это, я затеял нарисовать охоту.
— ставится в конце рубрик при перечислении:
Только в единственном числе употребляются:
а) некоторые вещественные существительные;
б) некоторые собирательные существительные;
в) абстрактные существительные.
  ''',

         'Запятая':'''
Запятая ставится:
— между однородными членами предложения:
Кругом росли синие, лиловые, голубые колокольчики.
— для выделения вводных слов и предложений, обращений, уточнений, обособленных второстепенных членов, слов да, конечно, ладно, нет, слова что, употребляемого для вопроса:
Нет, рано чувства в нём остыли. Что, испугался?
— при сравнительных оборотах.
— между частями сложного предложения:
Настало утро, и все разошлись по домам. ''',

         'Тире':''' Тире ставится:
— между подлежащим и сказуемым на месте пропуска связки:
Книга – источник знания.
— после однородных членов перед обобщающим словом:
В поле, роще, в воздухе – везде царило безмолвие.
— перед сказуемым или между сказуемыми для выражения быстроты действия или неожиданности:
Левей, левей – и с возом бух в канаву! Пришёл – и всех очаровал.
— для обособления некоторых приложений:
Со мной был Бим – вечный мой спутник и товарищ. Березин – высокий высохший старик с пожелтевшими от табака пальцами – подошёл к столу и попросил слова. В саду Петя увидел бабушку, Николая Николаевича – соседа по даче, сестру Катю с подругами.
— для выделения некоторых вставных и вводных конструкций:
Тут – делать нечего – они пожали друг другу руки.
 ''',

         'Скобки': ''' 
Скобки используются для выделения вставных конструкций, дополнительно включенных в высказывание сообщений, не согласованных с рядом стоящими частями:
В жаркое летнее время (это было в начале июля) мы отправились за ягодами в дальний лес.
''',

         'Кавычки':'''
         Кавычки выделяют:
— прямую речь:
“Что же будет?” – подумал он.
— цитаты:
“Краткость – сестра таланта”, – отмечал А.П.Чехов.
— названия предприятий, организаций, изданий, литературных произведений и произведений искусства, марок машин, сортов изделий и т.п.:
завод “Серп и молот”, журнал “Огонёк”, роман “Белая гвардия”, автомобиль “Москвич”, торт “Юбилейный”.
— слова, употребляемые не в своем обычном значении, иронически; слова, впервые предлагаемые; слова устарелые или необычные:
Как человек опытный, он начал наставлять меня на “путь истины”. Уже начались “палы”, или лесные пожары.''',

         'Абзац':'''Абзац (абзацный отступ):
— ставится на месте паузы, выделяющей значимые части текста. Начинает новую мысль, намечает переход от одной темы к другой:
Все математики, с которыми мне приходилось встречаться в школе и после школы, были людьми неряшливыми, слабохарактерными и довольно гениальными…
И всё-таки был один математик в нашей школе, который отличался от всех других…
— в диалоге разграничивает реплики разных лиц:
– Тит! Иди молотить!
– Брюхо болит.
– Тит! Иди кашу есть!
– А где моя большая ложка? '''
         }


categories = {'Спряжение':'''  Спряжение – это изменение глаголов по лицам и числам (например: я сплю – они спят). В русском языке глаголы имеют два спряжения: первое и второе. Знание спряжения необходимо для того, чтобы правильно определять буквы Е или И в безударных окончаниях.
Наклонение глагола выражает отношение действия, обозначаемого глаголом, к действительности. Наклонение бывает трех типов:
1. изъявительное наклонение, которое также носит название «индикатив». Эта форма означает, что действие произошло, происходит или произойдёт на самом деле. Глаголы в изъявительном наклонении меняются по временам. Причём для глаголов несовершенного вида имеют место все три времени: прошедшее, настоящее и сложное будущее.
например: думал – думаю – буду думать, делал – делаю – буду делать, искал – ищу – буду искать
А для совершенного вида – только два: прошедшее и простое будущее.
например: придумал – придумаю, сделал – сделаю, нашёл – найду.
В будущем и настоящем временах гласная, стоящая в конце основы инфинитива в некоторых случаях пропадает.
например: слышать – слышу, видеть – вижу.
2. повелительное наклонение, которое также носит название «императив». Эта форма означает просьбу, совет, приказ или побуждение к действию. Глаголы в повелительном наклонении чаще всего употребляются во 2-ом лице. В этом случае они имеют нулевое окончание в единственном числе и окончание «-те» во множественном. Также они не меняются по временам. Образуется повелительное наклонение с помощью основы глагола в настоящем или простом будущем времени, к которой прибавляется суффикс «-и-» или в некоторых случаях нулевой суффикс.
Например: Учти, ты должен это сделать! Брось заниматься ерундой! Посмотрите этот фильм!
3. условное или сослагательное наклонение, которое также носит название «субъюнктив». Эта форма означает, что действие в реальности не произошло, а только является желаемым, планируется в дальнейшем, несбыточно или осуществится при выполнении каких-то необходимых условий.
Например: Я полетел бы в космос изучать далёкие звёзды. Через год я хотел бы съездить на море. Я читал бы чужие мысли. Я пошёл бы гулять, если дождь прекратится.
Глаголы в настоящем и будущем времени для образования условного наклонения не используются. Оно составляется исключительно с помощью глагола прошедшего времени (то есть основы инфинитива, прибавления к ней суффикса «-л-»), а также частицы «бы» или «б». Данные частицы могут находиться как перед глаголом, так и после него, а также быть с ним разделены прочими словами.
Например: Я сходил бы в музей. Я сходил с удовольствием бы в музей.
Глаголы в условном наклонении меняются по числам, а в единственном числе ещё и по родам, но никогда не меняются по лицам и, как уже оговаривалось, по временам.
Например: посмотрел бы, посмотрела бы, посмотрели бы.
 Как определить первое спряжение
Первое спряжение — это все слова, которые не относятся ко второму типу спряжения.
К глаголам первого спряжения относят:
Слова, у которых в инфинитиве есть суффикс «еть».
Кроме: вертеть, видеть, зависеть, обидеть, ненавидеть, смотреть, терпеть.
Слова с суффиксом «ать».
Кроме: гнать, дышать, держать, слышать.
Слова, у которых есть суффикс -оть», «уть», «ть».
Глаголы-исключения с суффиксом «-ить»: стелить, брить, зыбиться и зиждиться.
Как определить второе спряжение
Ко второму спряжению относятся все глаголы, которые оканчиваются на «-ить», кроме: брить, зиждиться, стелить. Последние относятся к первому типу спряжения.
Также ко второму спряжению относятся семь глаголов, которые оканчиваются на «-еть»:: смотреть, вертеть, видеть, зависеть, ненавидеть, обидеть, терпеть. Другие глаголы с окончанием на «еть» относятся к первому спряжению.
Кроме того, ко второму спряжению относятся четыре глагола, которые оканчиваются на «-ать»: гнать, дышать, держать, слышать. Все другие слова с окончанием на «ать» относятся к первому спряжению.
Ко второму спряжению относятся глаголы с окончаниями:
-у (-ю),
-ишь,
-ит,
-им,
-ите,
-ат (-ят).
Разноспрягаемые глаголы могут спрягаться как по первому, так и по второму типу спряжения. К примеру, глагол «хотеть» в единственном числе третьего лица относят к первому типу спряжения («хочет»), а во множественном числе третьего лица — ко второму типу (они хотят).
Такие глаголы называют исключениями из правил — их просто нужно запомнить:
хотеть, чтить, бежать, брезжить.
Еще в русском языке есть категория глаголов, у которых особая система формирования окончания. Например:
есть: ем, едим, ешь, едите, ест, едят;
дать: даю, даем, даешь, даете, дает, дают.
Их тоже следует запомнить,чтобы не ошибаться.
 ''',


              'Наклонение':''' Наклонение глагола выражает отношение действия, обозначаемого глаголом, к действительности. Наклонение бывает трех типов:
1. изъявительное наклонение, которое также носит название «индикатив». Эта форма означает, что действие произошло, происходит или произойдёт на самом деле. Глаголы в изъявительном наклонении меняются по временам. Причём для глаголов несовершенного вида имеют место все три времени: прошедшее, настоящее и сложное будущее.
например: думал – думаю – буду думать, делал – делаю – буду делать, искал – ищу – буду искать
А для совершенного вида – только два: прошедшее и простое будущее.
например: придумал – придумаю, сделал – сделаю, нашёл – найду.
В будущем и настоящем временах гласная, стоящая в конце основы инфинитива в некоторых случаях пропадает.
например: слышать – слышу, видеть – вижу.
2. повелительное наклонение, которое также носит название «императив». Эта форма означает просьбу, совет, приказ или побуждение к действию. Глаголы в повелительном наклонении чаще всего употребляются во 2-ом лице. В этом случае они имеют нулевое окончание в единственном числе и окончание «-те» во множественном. Также они не меняются по временам. Образуется повелительное наклонение с помощью основы глагола в настоящем или простом будущем времени, к которой прибавляется суффикс «-и-» или в некоторых случаях нулевой суффикс.
Например: Учти, ты должен это сделать! Брось заниматься ерундой! Посмотрите этот фильм!
3. условное или сослагательное наклонение, которое также носит название «субъюнктив». Эта форма означает, что действие в реальности не произошло, а только является желаемым, планируется в дальнейшем, несбыточно или осуществится при выполнении каких-то необходимых условий.
Например: Я полетел бы в космос изучать далёкие звёзды. Через год я хотел бы съездить на море. Я читал бы чужие мысли. Я пошёл бы гулять, если дождь прекратится.
Глаголы в настоящем и будущем времени для образования условного наклонения не используются. Оно составляется исключительно с помощью глагола прошедшего времени (то есть основы инфинитива, прибавления к ней суффикса «-л-»), а также частицы «бы» или «б». Данные частицы могут находиться как перед глаголом, так и после него, а также быть с ним разделены прочими словами.
Например: Я сходил бы в музей. Я сходил с удовольствием бы в музей.
Глаголы в условном наклонении меняются по числам, а в единственном числе ещё и по родам, но никогда не меняются по лицам и, как уже оговаривалось, по временам.
Например: посмотрел бы, посмотрела бы, посмотрели бы.
 ''',
              'Вид':'''  Вид – это категория глагола, отражающая то, как говорящий видит течение действия во времени: закончившимся, длящимся, повторяющимся, разовым. В русском языке различают два вида: совершенный и несовершенный.
Глаголы несовершенного вида передают смысл действия, не указывая на его завершенность. Под эту категорию попадают слова трех типов:
1. Обозначающие длительное действие. Например: «Он долго смотрел ей в глаза», «Она бесконечно долго шла по улице».
2. Передающие значение повторяющегося действия. Пример: «Каждое утро она садится в автобус», «Он ходит в школу изо дня в день».
3. Характеризующие постоянное действие. Рассмотрим пример: «Город находится на возвышенности». 
Глаголы несовершенного вида во многих случаях сопровождаются наречиями «долго», «часто», «обычно», передающими периодичность, с которой совершается действие. Слова этого типа можно выразить тремя временами: настоящим, прошедшим, будущим.
Глаголы, относящиеся к совершенному виду, передают значение законченности действия. Ограничивают его временными рамками. Слова этого типа могут выражать:
1. Действие, которое закончилось достижением какого-либо результата. Например: «Настя нарисовала прекрасную картину», «Папа забил гвоздь в стену».
2. Действие, граница которого определяется его началом. К примеру: «В зале заиграла чудесная музыка», «Девушка запела прекрасный романс».
3. Однократное действие при условии, что слово образовано при помощи суффикса «ну»: «Он случайно толкнул меня в коридоре», «От злости он пнул портфель ногой».
Слова совершенного вида предстают только в формах прошедшего и будущего простого времени.
Глаголы обоих типов иногда образуют видовые пары. К этой категории относятся омонимичные слова, имеющие одно и то же значение, но с разными смысловыми оттенками. Рассмотрим примеры:
1. Оправдать и оправдывать. В первом случае мы видим завершенное действие, во втором — длительное.
2. Удвоить и удваивать. Первое слово передает значение действия, которое закончилось по достижении результата. Второе показывает продолжительность.
Чаще всего подобные глголы образуются от одной основы. Но бывают исключения, такие как «брать и взять» или «поймать и ловить». ''',
              'Время':''' Времена глаголов
o	Прошедшее время
o	Окончания глаголов прошедшего времени
o	Род и число глаголов прошедшего времени
o	Настоящее время
o	Будущее время
Глаголы в изъявительном наклонении изменяются по временам, то есть глагол может указывать на время, в которое происходит названное им действие. В русском языке существует три времени глаголов:
•	прошедшее время,
•	настоящее время,
•	будущее время.
Время, в форме которого может стоять глагол, связано с видом глагола. Глаголы несовершенного вида могут иметь форму всех трёх времён:
Прошедшее:  спал,  гулял.
Настоящее:  спит,  гуляет.
Будущее:  будет спать,  будет гулять.
Глаголы совершенного вида могут иметь форму только двух времён:
Прошедшее:  заснул,  погулял.
Будущее:  заснёт,  погуляет.
Глаголы условного и повелительного наклонения по временам не изменяются.
Прошедшее время
Глаголы прошедшего времени указывают, что действие уже произошло, то есть совершалось в прошлом, до разговора о нём. Они отвечают на вопросы  что делал?  что делали?  или  что сделал?  что сделали?  Например:
Вчера весь день (что делал?) читал.
Дети летом (что делали?) загорали.
Телефон вчера (что сделал?) выключился.
Птицы осенью (что сделали?) улетели.
Глаголы несовершенного вида в прошедшем времени указывают, что действие происходило в прошлом, без указания, было ли оно доведено до конца. Глаголы совершенного вида в прошедшем времени указывают, что действие было доведено до конца или совершилось один раз. Сравните:
дети (что делали?) загорали,
дети (что сделали?) загорели.
В глаголах прошедшего времени после шипящих под ударением произносится звук  о, а пишется буква  ё, например:
шёл,  пришёл,  сжёг,  поджёг.
Слово  бывало  совместно с глаголами, стоящими в разных временах, позволяет обозначать действия, которые происходили в далёком прошлом и неоднократно повторялись, например:
Раньше бывало и печку топили.
Зимой бывало придёт медведь к избе и угощение просит.
Пойдёшь бывало к озеру, а тут и дождь начинается.
Окончания глаголов прошедшего времени
Прошедшее время глагола образуется от неопределённой формы глагола. У инфинитива отбрасывается  -ть  и прибавляется суффикс  -л  — так образуется глагол прошедшего времени мужского рода:
стирать – стирал.
Для образования глагола женского рода после суффикса  -л-  добавляется окончание  -а:
стирал – стирала.
Для образования глагола среднего рода после суффикса  -л-  добавляется окончание  -о:
стирал – стирало.
Для образования глагола во множественном числе после суффикса  -л-  добавляется окончание  -и:
стирал – стирали.
Обратите внимание, что перед суффиксом  -л  пишутся те же гласные, что и в неопределённой форме перед суффиксом  -ть, например:
гулять – гулял,
мешать – мешал,
дарить – дарил.
У некоторых глаголов в прошедшем времени в мужском роде суффикса  -л  не бывает, например:
спас,  запер,  нёс,  тряс.
Род и число глаголов прошедшего времени
Глаголы прошедшего времени изменяются по числам. Глаголы прошедшего времени в единственном числе изменяются ещё и по родам.
Род глагола можно определить по его окончанию:
•	Мужской род: что делал? – нулевое окончание (спал  ).
•	Женский род: что делала? – окончание  -а  (спала).
•	Средний род: что делало? – окончание  -о  (спало).
Многие глаголы прошедшего времени имеют ударение на основе, кроме глаголов женского рода, в которых ударение переходит на окончание  -а, например:
спа́л – спала́,
гна́ло – гнала́,
рва́ли – рвала́.
Обратите внимание, что глаголы в прошедшем времени не изменяются по лицам:
я гулял,  ты гулял,  он гулял;
мы гуляли,  вы гуляли,  они гуляли.
Настоящее время
Глаголы настоящего времени указывают, что действие совершается сейчас, то есть в данный момент, когда о нём говорят. Они отвечают на вопросы  что делает?  что делают?  Например:
Он сейчас (что делает?) читает.
Дети (что делают?) загорают на пляже.
Глаголы в форме настоящего времени могут обозначать постоянно происходящие действия или долго длящиеся (длительные), не связанные с временем их обсуждения, например:
Люди спят по ночам.
Телефон работает третий год.
Форму настоящего времени имеют только глаголы несовершенного вида.
Будущее время
Глаголы будущего времени указывают, что действие еще не произошло, то есть оно совершится в будущем, после разговора о нём. Они отвечают на вопросы  что будет делать?  что будут делать?  или  что сделает?  что сделают?  Например:
Завтра он (что будет делать?) будет читать.
Дети летом (что будут делать?) будут загорать.
Программа (что сделает?) обновится.
Птицы осенью (что сделают?) улетят.
Будущее время может быть простое и сложное:
1) Будущее простое время имеют глаголы совершенного вида, например:
Я нарисую портрет.
Будущее простое время обозначает, что действие будет закончено или будет иметь результат.
2) Будущее сложное время имеют глаголы несовершенного вида. Форма будущего сложного времени состоит из двух слов: глагола  быть, стоящего в будущем простом времени, и инфинитива. 
  ''',
              'Залог':''' 
               Залог – это постоянная лексико-грамматическая категория глагола, которая выражает отношения между действием, называемым глаголом, субъектом и объектом этого действия (выраженными подлежащим и дополнениями).
Грамматические средства выражения залоговых значений могут быть морфологическими и синтаксическими.
Морфологическими средствами при образовании залогов служат:
— постфикс -ся, присоединяемый к глаголу:
радовать — радоваться
— суффиксы действительных и страдательных причастий:
видящий — видевший и видимый — виденный
Синтаксическими средствами выражения залоговых значений являются:
— синтаксическое различие в выражении субъекта и объекта действия:
Волны размывают берег. — Берег размывается волнами.
— наличие объекта действия или полное отсутствие его:
Дождь повышает урожай. — Дождь начинается.
— различие форм и значений существительных, управляемых глаголом:
Договор заключается начальником. — Договор заключается с начальником.
Виды залогов: действительный, средневозвратный и страдательный.
Действительный залог имеют глаголы переходные, обозначающие действие, производимое субъектом и активно направленное на объект. Действительный залог имеет синтаксическую характеристику: субъект действия является подлежащим, а объект — дополнением в винительном падеже без предлога:
Красота спасет мир.
Средневозвратный залог имеют глаголы, образованные от переходных глаголов (действительного залога) посредством постфикса -ся. Они выражают действие субъекта, не переходящее на прямой объект, а как бы возвращающееся к самому субъекту, сосредоточенное в нем.
Например: возвращать журнал и возвращаться (самому), сконцентрировать внимание и сконцентрироваться (самому).
В зависимости от лексического значения основ и характера синтаксических связей глаголы средневозвратного залога могут выражать оттенки значения, по-разному характеризующие отношение между субъектом и объектом действия.
Собственно-возвратные глаголы выражают действие, субъект и объект которого совпадают, т.е. являются одним и тем же лицом: Женя оделся быстро. Постфикс -ся в этих глаголах имеет значение «себя».
Взаимно-возвратные глаголы обозначают действие нескольких лиц, направленное друг на друга, т.е. совместное действие нескольких субъектов. Постфикс -ся у таких глаголов имеет значение «друг друга»: целоваться, обниматься, мириться, ссориться, встречаться.
Общевозвратные глаголы выражают внутреннее состояние субъекта, замкнутое в самом субъекте, или изменение в состоянии, положении, движении субъекта:
тревожиться, удивляться, пугаться, огорчаться, передвигаться.
Косвенно-возвратные глаголы обозначают действие, совершаемое субъектом в своих интересах, для себя:
строиться, запасаться, укладываться, прибираться.
Безобъектно-возвратные глаголы обозначают действие вне отношения к объекту, замкнутое в субъекте как постоянное его свойство:
Крапива жжется, собака кусается, кошки царапаются.
Страдательный залог — это форма глагола, показывающая, что лицо или предмет, выступающие в предложении в роли подлежащего, не производят действия (не являются его субъектом), а испытывают на себе чье-либо действие (являются его объектом). Страдательный залог по значению соотносится с действительным, но имеет свою морфологическую и синтаксическую характеристику.
Страдательный залог выражается присоединением к глаголам действительного залога постфикса -ся (Рабочие строят дома. — Дома строятся рабочими). Кроме того, значение страдательного залога может быть выражено формами страдательных причастий — полных и кратких.
Например: Мать любима (любимая). Тема изучена (изученная).
Сопоставление конструкции — Фабрика выполняет план (действительная конструкция) и План выполняется фабрикой (страдательная конструкция) показывает, что в действительной конструкции субъект действия выражен подлежащим, а объект — дополнением в винительном падеже, а в страдательной подлежащим становится объект, а бывший субъект оказывается дополнением в творительном падеже.
Таким образом, страдательный залог представляет действие как пассивно направленное от объекта к субъекту. Важнейшим грамматическим показателем страдательного залога является творительный падеж существительного со значением реального субъекта действия. Отсутствие творительного падежа сближает страдательное значение глагола со средневозвратным, особенно в случае, когда подлежащим является название лица:
Лыжники отправляются в поход. Письма отправляются по почте. Посылки отправляются экспедитором.''',
              'Лицо':'''
              Лицо в русском языке выступает в качестве важнейшего морфологического признака глаголов. При помощи лиц в предложении выражается отношение того, кто производит действие к тому, кто о нем говорит.
Существуют три формы лиц: 1-е, 2-е и 3-е. 
В форме 1-го лица находятся те глаголы, случаи употребления которых, предусматривают совпадение совершающего действие и того, кто о нем говорит.
Пример: Я кушаю, я делаю, я говорю, я сплю, мы делаем и т.д.
Глаголы во 2-м лице указывают на то, что совершаемое действие относится не к самому рассказчику, а к его собеседнику.
Пример: Ты делал, ты кушал, ты говорил, ты спал, вы делаете.
Глаголы, находящиеся в 3-ем лице выражают отношение действия к человеку (людям), не участвующим в разговоре и обычно употребляются с местоимениями – он, она, оно, они.
Пример: Он делал, он кушал, он говорил, они спали, она делала, оно выпало.
              ''',
              'Падеж':'''  
              Падеж – это грамматическая категория слова (обычно имени), показывающая его синтаксическую роль в предложении и связывающая отдельные слова в предложении. Внешнее выражение падежи находят в шести рядах окончаний существительных, прилагательных, местоимений и числительных:
Именительный – слово в именительном падеже отвечает на вопрос кто? что?: человек, стена;
Родительный – слово в родительном падеже отвечает на вопрос кого? чего?: человека, стены;
Дательный – слово в дательном падеже отвечает на вопрос кому? чему?: человеку, стене;
Винительный – слово в винительном падеже отвечает на вопрос кого? что?: [видеть] человека, стену;
Творительный – слово в творительном падеже отвечает на вопрос кем? чем?: человеком, стеной;
Предложный – слово в предложном падеже отвечает на вопрос о ком? о чем?: о человеке, о стене.
Именительный и винительный падеж называются прямыми, остальные – косвенными.''',
              'Склонение':''' 
               Склонением называется:
— способ изменения существительных по падежам;
— класс существительных, объединенных одним типом основы и одинаково изменяющихся по падежам.
Выделяется три типа склонения:
1. К первому склонению принадлежат существительные мужского и женского рода, имеющие в именительном падеже единственном числе окончание -а/-я:
девочка, дядя.
2. Ко второму склонению принадлежат существительные мужского рода с основой на согласный и с нулевым окончанием: конь, стол и среднего рода с окончаниями -о, -е, -ё:
окно, ружьё, поле.
3. К третьему склонению принадлежат существительные женского рода с основой на мягкий или шипящий согласный:
лошадь, рожь.''',
              'Число':'''  
Большинство имен существительных в русском языке — это предметы, поддающиеся счету. Они могут употребляться в сочетании с количественными числительными. Такие существительные имеют формы и единственного, и множественного числа:
стол – столы, парта – парты, облако – облака.
Эти формы имеют разные окончания и по-разному сочетаются с другими частями речи.
Если единственное число используется для обозначения единичного предмета из ряда подобных, то множественное число обозначает множество однородных предметов.
В большинстве случаев у существительных во множественном числе имеются окончания –ы, –и, –а, –ья (ствол – стволы, девочка — девочки, место – места, дерево – деревья). В некоторых случаях в основе слова наблюдается чередование или выпадение/добавление гласных (друг – друзья, венок – венки, кусок – куски).
Следует также обратить внимание на то, что в единственном числе существительные каждого из трех родов имеют разные окончания. Множественное число скрывает родовые признаки, поэтому, например, существительные стена, ночь, деревня (женского рода) и пень, стол, нож (мужского рода) имеют в этой ситуации идентичные окончания: стены, ночи, деревни, пни, столы, ножи. В этом проявляется особенность языка, когда в данном случае главное показать количество предметов, а не их род.
Некоторые существительные в русском языке обозначают множественность формой единственного числа. У таких слов не образуется множественное число. Это существительные:
вещественные (молоко, крупа, масло, шелк, золото и др.);
собирательные (человечество, студенчество, листва);
отвлеченные (терпение, давление, доброта);
собственные (Москва, Париж, Рона).
Существуют случаи употребления слов из этого списка во множественном числе: сыры, крупы, колбасы и др. Но здесь множественное число обозначает скорее различные сорта, а не количество, например:
«Мясокомбинат производит различные виды колбас».
В противовес существительным, которые не образуют множественное число, в языке есть слова, которые существуют лишь в форме множественного числа. Это существительные:
отвлеченные (сумерки, каникулы);
вещественные (сливки, щи);
названия некоторых игр (прятки, жмурки, шашки, шахматы);
предметы, включающие в себя несколько частей (ножницы, брюки, джинсы, весы и др.).''',
              'Род':''' 
               Род – грамматическая категория, свойственная разным частям речи в единственном числе и состоящая в распределении слов по трем классам, традиционно соотносимым с признаками пола или их отсутствием.
В русском языке выделяют три рода имен существительных:
Мужской (он) Существительные мужского рода в единственном числе именительном падеже имеют окончания -а, -я, и нулевое (папа, дядя, нож, стол, ястреб).
Женский (она) Существительные женского рода в единственном числе именительном падеже имеют окончания —а, -я, и нулевое (жена, няня, ночь, слава, пустыня).
Средний (оно) Существительные среднего рода в единственном числе именительном падеже имеют окончания -о, -е (болото, золото, солнце, озеро, варенье).
Также существует класс слов общего рода, которые, в зависимости от контекста, могут употребляться и в мужском, и в женском роде (зануда, неженка, плакса, умница, жадина).
Категория рода не определяется у слов, которые употребляются только во множественном числе (брюки, ножницы, сливки, будни).''',
              'Одушевленность/неодушевленность':''' 
               Одушевленность/неодушевленность отражает разделение человеком окружающего мира на живое и неживое.
Одушевленные существительные – это названия людей и животных: человек, сын, дочь, кот, ворона.
Неодушевленные существительные – это названия всех других предметов и явлений.
Падежные окончания одушевленных и неодушевленных существительных и зависимых от них прилагательных (местоимений, числительных) различаются: одушевленные существительные во множественном числе имеют форму винительного падежа, совпадающую с формой родительного падежа:
нет братьев и сестёр (родительный падеж), увидел братьев и сестёр (винительный падеж).
Неодушевленные существительные во множественном числе имеют форму винительного падежа, совпадающую с формой именительного падежа:
яблоки лежат на столе (им. п.), я всегда покупаю яблоки (вин. п.).
В единственном числе у одушевленных существительных второго склонения совпадают формы родительного и винительного падежей: нет брата, вижу брата, а у неодушевленных – формы именительного и винительного падежей: нужен карандаш, купил карандаш.'''}